Repository: fgNv/GSDRequirementsCSharp
Catalog: GSDRequirementsCSharp.Infrastructure/Internationalization/HelpSentences.*.resx
Languages: pt

source: Access permissions for other users are granted by project.
pt: Permissão de acesso para outros usuários é concedida por projeto.

source: After submiting the registration data, you will be able to authenticate and manage projects.
pt: Após submeter os dados de cadastro, você poderá autenticar e gerenciar projetos.

# andWhenInsertingNewDataTheFirstLanguageAddedWillBeTheOneSelected
source: Besides, when inserting new data, the first language added will be the one selected.
pt: e ao inserir novos dados, o primeiro idioma adicionado será o selecionado

source: Artifacts are requirements, class diagrams and use case diagrams.
pt: Artefatos são requisitos, diagramas de classe e diagramas de caso de uso

source: Before you can manage projects and artifacts, you must register.
pt: Antes de você poder gerenciar os projetos e artefatos, você deve realizar um cadastro.

# byDoingSoTranslationsOfTheDataWillBeDisplayedIfAvailableInsteadOfTheOriginalData
source: By doing so, translations in the selected language will be displayed if available instead of the original data
pt: ao fazer isso traduções das informações no idioma selecionado serão exibidas (caso disponíveis), em vez da informação original.

# forThisPurposeAlmostAllDataInsertedCanHaveATranslatedVersion
source: For this porpose, almost all data inserted can have a translated version.
pt: Para esse propósito, praticamente todos os dados inseridos podem ter uma versão traduzida em outro idioma.

source: GSD Stands for Global Software Development, in other words, a team with members from different countries.
pt: GSD quer dizer Global Software Development (Desenvolvimento de sofware global), em outras palavras, equipes de desenvolvedores, analistas e demais envolvidos de diferentes países.

source: is a tool for requirement management aimed for global teams.
pt: é uma ferramenta de gerenciamento de requisitos direcionada para equipes globais.

source: Its possible to change the current language pressing the change language button (globe) in the header of the page.
pt: É possível alterar o idioma atual pressionando o botão "Alterar idioma" (globo) no topo da página.

source: Packages that contains artifacts
pt: Pacotes contém artefatos

source: Project that contains packages
pt: Projetos contém pacotes

# theProjectManagementIsAccessibleByTheManageProjectsAtThePageHeader
source: The project management is accessible by the manage projects button at the page header.
pt: O gerenciamento de projetos é acessível pelo botão "Gerenciar projetos" no topo da página.

# theRequirementsManagementInThisToolIsMeantToBeMadeCollaboratively
source: The requirement management in this tool is meant to be made collaboratively.
pt: O gerenciamento de requisitos nessa ferramenta é para ser feito de forma colaborativa.

source: This can be accomplished by pressing the "Register" button below the login form.
pt: Isso pode ser feito pressionando o botão \"Realizar Cadastro\", que está abaixo do formulário de autenticação.

# butItsPossibleToAddTranslationBeforeSubmittingTheData
source: but its possible to add translations before submitting the data.
pt: mas é possível adicionar traduções antes de submeter os dados

# byClickingTheEditButtonYouWillBeAbleToEditAProject
source: By clicking the "Edit Button" (Pencil) in the project list, you will be able to edit a project.
pt: Ao clicar o botão de editar (lápis) na listagem de projetos, você poderá editar um projeto.

source: Creating a new project
pt: Criando um novo projeto

source: Data inserted at first will refer to
pt: Os primeiros dados inseridos serão references ao

source: if the current language contains an obsolete translation.
pt: Se o idioma atual possui uma tradução obsoleta.

source: It will provide access to a form where it's possible to add the missing translations.
pt: Isso irá disponibilizar um formulário onde é possível adicionar traduções para os idiomas que não a possuem ainda.

source: Next to the "Manage Projects" button, there's the project context control, which defines which project data is displayed.
pt: Do lado do botão "Gerenciar Projetos", está o controle do projeto do contexto, que define os dados de qual projeto serão exibidos.

source: Pressing the button "create project" (plus sign) in the "Manage Project Screen", will lead you to the create project form.
pt: Pressionar o botão "criar projeto" (sinal de soma) na tela de Gerenciamento de projetos, irá disponibilizar o formulário de criação de projeto.

source: The "Add Translation" button will be available when there are obsolete translations, to update them.
pt: o botão "Adicionar tradução" ficará disponível quando houver traduções obsoletas, permitindo atualizá-las.

source: the current language
pt: idioma atual

source: the translations will be considered obsolete, and a warning in the row will be displayed
pt: As traduções serão consideradas obsoletas e um aviso na linha será exibido.

source: When creating a project and not providing translation for all languages, an "Add Translation" Button (globe) will be available in the project list.
pt: Ao criar um projeto e não disponibilizar traduções para todos os idiomas, o botão "Adicionar tradução" (Globo) será disponbilizado na listagem de projetos.

source: When editing a project with translations, but not updating them
pt: Ao editar um projeto com traduções, mas não atualizá-las

source: All actions related to projects can be done only by its owner which is the user that created it.
pt: Todas as ações relacionadas a projeto podem ser feitas apenas pelo seu dono, que é o usuário que o criou.

source: Editing a project
pt: Editando um projeto

source: Removing a project
pt: Removendo um projeto

source: This action is irreversible
pt: Essa ação é irreversível.

# toRemoveAProjectItsNecessaryToPressTheRemoveProjectButtonAndConfirmTheAction
source: To remove a project, it's necessary to press the "Remove Project" button (trash) in the project list, and confirm the action.
pt: Para remover um projeto, é necessário clicar no botão "Remover Projeto" (lixo) na listagem de projetos, e confirmar a ação.

source: Context project
pt: Projeto do contexto

source: To manage a project packages, artifacts and permissions, it must be selected in the context.
pt: Para gerenciar os pacotes, artefatos e permissões de um projeto, ele deve estar selecionado no contexto.

source: After selecting a project in the context, menu items for managing the project data appear in the header's left side.
pt: Após selecionar um projeto no contexto, itens de menu para gerenciar os dados do projeto são disponibilizados no topo da página, no lado esquerdo.

source: After selecting a project in the context, the packages button will be displayed in the header's left side.
pt: Após selecionar um projeto no contexto, o botão "Pacotes" será disponibilizado no lado esquerdo superior da tela.

# byClickingTheEditButtonYouWillBeAbleToEditAPackage
source: By clicking the "Edit Package" button (pencil), in the package list, you will be able to edit a package.
pt: Ao clicar no botão "Editar pacote" (lápis, na listagem de pacotes, você poderá editar um pacote.

source: Creating a new package
pt: Criando um novo pacote

source: Data inserted at first, will refer to the current language, but it's possible to add translation before submitting the data.
pt: Os primeiros dados inseridos, serão references ao idioma atual, mas é possível adicionar traduções para outros idiomas antes de submeter os dados.

source: Editing packages
pt: Editando pacotes

source: If no translation is provided for any language, afterwards the button "Add Translation" will be available in the list for providing missing translations.
pt: Se a tradução não for fornecida para qualquer idioma, depois o botão "Adicionar Tradução" estará disponível na listagem de pacotes, para fornecer as traduções que estejam faltando.

source: It will lead you to the "Manage Packages" page, where it's possible to create, edit and remove packages.
pt: Clicando nele, a página de gerenciamento de pacotes é exibida, onde é possível criar, editar e remover pacotes.

source: Pressing the "Create Package" button (plus sign) in the "Manage Package" screen, will lead you to the "Create Package" Form
pt: Pressionando o botão "Criar pacote" (sinal de soma) na página "Gerenciar Pacotes", o formulário "Criar pacote" será exibido.

source: Removing packages
pt: Removendo pacotes

# toRemoveAPackageItsNecessaryToPressTheRemovePackageButtonAndConfirmTheAction
source: To remove a package, it's necessary to press the "Remove Package" button (trash) in the package list, and confirm the action.
pt: Para remover um pacote, deve-se pressionar o botão "Remover pacote" (lixo) na lista de pacotes, e confirmar a ação.

source: When editing a package with translations, but not updating them
pt: Quando se edita um pacote com traduções, mas não as atualiza

source: After adding the users and defining their profiles, you must click the "Save" button.
pt: Após adicionar os usuários e definir seus perfis, deve-se clicar no botão "Salvar".

source: After selecting a project in the context, the permissions button will be displayed in the header's left side.
pt: Após selecionar um projeto no contexto, o botão de Permissões ficará disponível no canto superior esquerdo da tela.

source: Can add, comment and conclude issues
pt: Pode adicionar, comentar e concluir observações.

source: Can add, edit, translate and exclude packages and artifacts
pt: Pode adicionar, editar, traduzir e excluir pacotes e artefatos.

source: Can see packages and artifacts details
pt: Pode ver os detalhes de pacotes e artefatos.

source: Granting permissions
pt: Concedendo permissões

source: It's possible to grant permissions by clicking the "grant permission" button (plus sign) in the "Manage Project Permissions" page
pt: É possível conceder permissões clicando no botão "Conceder permissão" (sinal de mais) na página"Gerenciar permissões do projeto"

source: It will lead you to the "Manage Permissions Page", where it's possible to manage the permissions of the projects that you own.
pt: Ele irá leva-lo para a página "Gerenciar Permissões", onde é possível gerenciar permissões dos projetos que você possui.

source: Permission Profiles
pt: Perfis de permissões

source: Revoking permissions
pt: Revogando permissões

# thenItsNecessaryToSearchAnUserByNameOrEmailAndSelectTheProfile
source: then it's necessary to search for an user by name or email, and select the profile.
pt: então é necessário buscar um usuário por nome ou e-mail, e selecionar o perfil.

source: The user must be already registered for the permission to be granted.
pt: O usuário já deve estar registrado para que a permissão seja concedida.

# toPerformTheseActionsItsRequiredToBeTheProjectOwner
source: To perform these actions, it's required to be the project's owner.
pt: Para executar essas ações, é necessário ser o dono do projeto.

source: To perform these actions, it's required to have an "Editor Permission" in the project, or to be its owner.
pt: Para executar essas ações, deve-se possuir a "Permissão de Editor" no projeto, ou ser o seu dono.

source: To revoke a permission, you must press the "Revoke Permission" button (trash) in the "Manage Project Permissions" screen and then click the save button.
pt: Para revogar uma permissão, você deve pressionar o botão "Revogar permissão" (lixo) na página "Gerenciar permissões do projeto" e então clicar no botão salvar.
