Repository: fgNv/GSDRequirementsCSharp
Catalog: GSDRequirementsCSharp.Infrastructure/Internationalization/ValidationMessages.*.resx
Languages: pt

# actionMaxLengthIs150
source: Max "Action" length is 150
pt: O tamanho máximo do campo "Ação" são 150 caracteres

# classDiagramIdIsRequiredField
source: "Class Diagram Id" is a required field
pt: "Id do Diagrama de Classes" é um campo obrigatório

source: "Class Type" is a required field
pt: "Tipo de Classe" é um campo obrigatório

# conditionMaxLengthIs150
source: Max "Condition" length is 150
pt: O tamanho máximo do campo "Condição" são 150 caracteres

source: "Description" is a required field
pt: "Descrição" é um campo obrigatório

source: "Difficulty" is a required field
pt: "Dificuldade" é um campo obrigatório

source: Email field must have a valid email address
pt: O campo "E-mail" deve conter um e-mail válido

source: "Email" is a required field
pt: "E-mail" é um campo obrigatório

source: "Id" is a required field
pt: "Id" é um campo obrigatório

source: "Issue comment id" is a required field
pt: "Id do comentário da obsevação" é um campo obrigatório

source: "Issue Id" is a required field
pt: "Id da observação" é um campo obrigatório

source: "Locale" is a required field
pt: "Idioma" é um campo obrigatório

source: "Login" is a required field
pt: "Login" é um campo obrigatório

source: Max "Email" length is 50
pt: O tamanho máximo do campo "E-mail" são 50 caracteres

source: Max "Login" length is 50
pt: O tamanho máximo do campo "Login" são 50 caracteres

# maxMobilePhoneLengthIs50
source: Max "Mobile Phone" length is 20
pt: O tamanho máximo do campo "Celular" são 50 caracteres

source: Max "Name" length is 100
pt: O tamanho máximo do campo "Nome" são 100 caracteres

source: Max "Password" length is 50
pt: O tamanho máximo do campo "Senha" são 50 caracteres

# maxPhoneLengthIs20
source: Max "Phone" length is 50
pt: O tamanho máximo do campo "Telefone" são 20 caracteres

source: "Method visibility" is a required field
pt: "Visibilidade do método" é um campo obrigatório

# minPasswordLengthIs4
source: Minimun "Password" length is 4
pt: O tamanho mínimo do campo "Senha" são 4 caracteres

source: "Mobile Phone" must contain only numbers
pt: O celular deve conter apenas números

source: "Name" is a required field
pt: "Nome" é um campo obrigatório

source: "Origin" is a required field
pt: "Origem" é um campo obrigatório

source: "Package Id" is a required field
pt: "Id do pacote" é um campo obrigatório

source: "Package" is a required field
pt: "Pacote" é um campo obrigatório

source: "Parameter Name" is a required field
pt: "Nome do parâmetro" é um campo obrigatório

source: "Parameter Type" is a required field
pt: "Tipo do parâmetro" é um campo obrigatório

source: "Password" is a required field
pt: "Senha" é um campo obrigatório

source: "Path" is a required field
pt: "Narrativa" é um campo obrigatório

source: "Phone" must contain only numbers
pt: O telefone deve conter apenas números

source: "Project id" is a required field
pt: "Id do projeto" é um campo obrigatório

# propertyNameIsARequiredField
source: "Propert Name" is a required field
pt: "Nome da propriedade" é um campo obrigatório

source: "Property Type" is a required field
pt: "Tipo da propriedade" é um campo obrigatório

source: "Property Visibility" is a required field
pt: "Visibilidade da propriedade" é um campo obrigatório

source: "Rank" is a required field
pt: "Prioridade" é um campo obrigatório

source: "Relation Description" is a required field
pt: "Descrição da relação" é um campo obrigatório

source: "Relation Locale" is a required field
pt: "Idioma da relação" é um campo obrigatório

# requirementDescriptionRequired
source: A requirement with an empty description is not allowed
pt: Um requisito com a descrição vazia não é permitido

source: "Requirement id" is a required field
pt: "Id do requisito" é um campo obrigatório

source: "Requirement" is a required field
pt: "Requisito" é um campo obrigatório

source: "Requirement type" is a required field
pt: "Tipo do Requisito" é um campo obrigatório

source: "Return Type" is a required field
pt: "Tipo do retorno" é um campo obrigatório

source: "Source" is a required field
pt: "Fonte" é um campo obrigatório

source: "Specification item id" is a required field
pt: "Id do item de especificação" é um campo obrigatório

source: "Specification item" is a required field
pt: "Item de especificação" é um campo obrigatório

# subjectMaxLengthIs150
source: Max "Subject" length is 150
pt: O tamanho máximo do campo "Sujeito" são 150 caracteres

source: "Target" is a required field
pt: "Alvo" é um campo obrigatório

source: "Type" is a required field
pt: "Tipo" é um campo obrigatório

source: "Use Case Description" is a required field
pt: "Descrição do caso de uso" é um campo obrigatório

source: "Use Case Locale" is a required field
pt: "Idioma do caso de uso" é um campo obrigatório

source: "Use Case Name" is a required field
pt: "Nome do caso de uso" é um campo obrigatório

source: "User Id" is a required field
pt: "Id do usuário" é um campo obrigatório

source: "Version" is a required field
pt: "Versão" é um campo obrigatório
